#Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
#[2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12

n = int(input("Введите число N "))
summ=0
if n<1:
    print ("Данное значение не удовлетворяет условию задачи,введите число больше или равное 1")
else:
    print("Введите числовые знчеия списка,\nпосле каждого элемента нажмите Enter")
    list = []
    for i in range(n) : 
        list.append(float(input('>> ')))
    print(list)
    
    summ=0
    
    print("На нечетных позициях находятся числа :")
    for i in range(n):
        if i%2==1:
            summ=summ+list[i]
            print(str(list[i])+"")
    
    print("Ответ:"+str(summ))

