#Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
#Пример:
#6782 -> 23
#0,56 -> 11


num = input("Введите число ")
sum =0
for i in range (len(num)):
    if num[i].isdigit():
        temp = int(num[i])
        sum=sum+temp
        

print ("Сумма цифр числа = " + str(sum))

#подумать над проверкой, является ли все число числом,а не буквенной строкой