#3. Задайте список из n чисел последовательности (1+1/n)n и выведите на экран их сумму
#Пример:
#Для n=4 {1: 2, 2: 2.25, 3: 2.37, 4: 2.44} 
#Сумма 9.06



n = int(input("Введите число N "))
summ=0
if n<1:
    print ("Данное значение не удовлетворяет условию задачи,введите число больше или равное 1")
else:
    list = []
    for i in range(n) : 
        temp=i+1
        i=(1+ 1/temp)**temp
        print(i) 
        summ=summ+i
    
    print("Сумма  = " +str(summ))