#Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
#Пример:
#6 -> да
#7 -> да
#1 -> нет

num = int(input("Введите число "))
if(0<num<6):
    print("нет")
elif (num == 7 or num == 6):
    print("да")
else:
    print("не является днем недели")